adamj537/Code-Library/Processor_Peripherals/TI_MSP430x5/I2C.c
/******************************************************************************
 *
 *	Filename:		I2C.c (for TI's MSP430)
 *
 *	Author:			Adam Johnson
 *
 *	Description:	This is an I2C master transmitter module which uses
 *					interrupts.
 *
 *	Notes:		(1) If you choose to use USCIB0, the UCB0SDA and UCB0SCL lines
 *					are not assigned to a dedicated port and need to be
 *					assigned to PMAP ports.
 *
 *				(2) External pull-ups are required...the GPIO's internal
 *					pull-ups don't appear usable when in I2C mode.  Here's the
 *					schematic for the test function:
 *
 *					                     /|\  /|\
 *					     MSP430F665x     10k  10k       EEPROM
 *					       master         |    |         24C02
 *					  -----------------   |    |   -----------------
 *					-|XIN  P2.0/UCB0SDA|<-|----+->|SDA              |
 *					 |                 |  |       |                 |
 *					-|XOUT             |  |       |                 |
 *					 |     P2.1/UCB0SCL|<-+------>|SCL              |
 *					 |                 |          |                 |
 *
 *				(3) The acts of (1) reading from UCBxRXBUF, (2) setting UCTXSTT
 *					bit, and (2) setting UCTXSTP bit all cause new data to be
 *					clocked into UCBxRXBUF.  So before getting the last byte in
 *					a receive transaction, we disable the RX interrupt, do both
 *					actions, and then enable it again.  Otherwise we will lose
 *					the 2nd-to-last byte of data in the transaction.  We also
 *					need to do something similar when receiving only one byte.
 *
 *	Terms of Use:	MIT License
 *
 *****************************************************************************/

#include <msp430.h>						// required by development platform
#include "Datatypes.h"					// compiler-specific data types
#include "MSP430_I2C.h"					// header for this module

// USCI registers - the numbers are offsets from a "base address" defined in
// the handleToBaseAddress array below.
#define I2CREG_CTLW0		0x0000		// Control Word
#define I2CREG_CTL1			0x0000		// control 1
#define I2CREG_CTL0			0x0001		// Control 0
#define I2CREG_BRW			0x0006		// Baud Rate Control Word
#define I2CREG_BR0			0x0006		// Baud Rate Control 0
#define I2CREG_BR1			0x0007		// Baud Rate Control 1
#define I2CREG_STAT			0x000A		// Status Register
#define I2CREG_RXBUF		0x000C		// Receive Buffer
#define I2CREG_TXBUF		0x000E		// Transmit Buffer
#define I2CREG_OA			0x0010		// I2C Own Address
#define I2CREG_SA			0x0012		// I2C Slave Address
#define I2CREG_ICTL			0x001C		// Interrupt Enable Register
#define I2CREG_IE			0x001C		// USCI Bx Interrupt Enable Register
#define I2CREG_IFG			0x001D		// USCI Bx Interrupt Flags Register
#define I2CREG_IV			0x001E		// Interrupt Vector Register

// Macros to help with register access.
#define REG16(x)			(*((volatile uint16_t *)((uint16_t)x)))
#define REG8(x)				(*((volatile uint8_t *)((uint16_t)x)))

// This array holds the address of the lowest register in each I2C peripheral.
// If we know that address and the "offset" of each register (defined above),
// then we can access any register of any I2C peripheral.
static const uint16_t baseAddr[] = {
#if defined(__MSP430_HAS_USCI_B0__)		// USCI B0
	__MSP430_BASEADDRESS_USCI_B0__,
#endif

#if defined(__MSP430_HAS_USCI_B1__)		// USCI B1
	__MSP430_BASEADDRESS_USCI_B1__,
#endif

#if defined(__MSP430_HAS_USCI_B2__)		// USCI B2
	__MSP430_BASEADDRESS_USCI_B2__,
#endif

#ifdef __MSP430_HAS_USCI_B3__			// USCI B3
	__MSP430_BASEADDRESS_USCI_B3__,
#endif
};

volatile uint8_t *txDataPtr[I2C_NUM_CHANNELS];	// pointer to TX data
volatile uint32_t txByteCtr[I2C_NUM_CHANNELS];	// number of bytes to TX

volatile uint8_t *rxDataPtr[I2C_NUM_CHANNELS];	// pointer to RX data
volatile uint32_t rxByteCtr[I2C_NUM_CHANNELS];	// number of bytes to RX

/******************************************************************************
 *
 *	Function:		I2CInit
 *
 *	Description:	Initializes the specified I2C with the provided settings.
 *
 *	Parameters:		i2cChannel_t channel - which I2C peripheral to act upon
 *					i2cConfig_t *configPtr - settings to apply to the channel
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CInit(i2cChannel_t channel, i2cConfig_t *configPtr)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value ;)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.
	uint16_t preScalarValue;

	// Reset global variables in case we were stuck somewhere.
	txByteCtr[channel] = 0;
	rxByteCtr[channel] = 0;

	// Check for invalid handle.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	// Configure in slave mode if requested.
	else if ((configPtr->mode == I2C_MODE_SLAVE) ||
			(configPtr->mode == I2C_MODE_SLAVE_AND_GEN_CALL))
	{
		// Disable the USCI module and clear the other bits of control register.
		REG8(base + I2CREG_CTL1) = UCSWRST;

		// Clear USCI master mode.
		REG8(base + I2CREG_CTL0) &= ~UCMST;

		// Configure I2C as Slave and Synchronous mode.
		REG8(base + I2CREG_CTL0) = UCMODE_3 | UCSYNC;

		// Set up the slave address.
		REG16(base + I2CREG_OA) = configPtr->address;

		// Enable general call if requested.
		if ((configPtr->mode == I2C_MODE_SLAVE_AND_GEN_CALL)
		{
			REG16(base + I2CREG_OA) |= UCGCEN;
		}
		else
		{
			REG16(base + I2CREG_OA) &= ~UCGCEN;
		}
	}

	// Configure in master (or multi-master) mode if requested.
	else
	{
		// Disable the USCI module.
		REG8(base + I2CREG_CTL1) |= UCSWRST;

		// Configure as I2C master mode.
		// UCMST = Master mode; UCMODE_3 = I2C mode; UCSYNC = Synchronous mode
		REG8(base + I2CREG_CTL0) = UCMST | UCMODE_3 | UCSYNC;

		// If multi-master mode is selected, enable it.
		if (config->mode == I2C_MODE_MULTI_MASTER)
		{
			REG8(base + I2CREG_CTL0) |= UCMM;
		}
		else
		{
			REG8(base + I2CREG_CTL0) &= ~UCMM;
		}

		// Configure I2C clock source.
		REG8(base + I2CREG_CTL1) = (I2C_CLOCK_SOURCE + UCSWRST);

		// Compute the clock divider to give close to the desired speed.
		preScalarValue = (unsigned short)(I2C_CLOCK_FREQ_HZ / config->speed);
		REG16(base + I2CREG_BRW) = preScalarValue;

		// Set the address we'll attempt to talk to.
		REG8(base + I2CREG_SA) = config->address;
	}

	return result;
}

