adamj537/Code-Library/Processor_Peripherals/TI_MSP430x5/I2C.c
/******************************************************************************
 *
 *	Function:		I2CEnable
 *
 *	Description:	Turns on the specified I2C channel.  This is separate from
 *					the init function so that the channel can be enabled and
 *					disabled without reconfiguring it.
 *
 *	Parameters:		i2cChannel_t channel - which I2C peripheral to act upon
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CEnable(i2cChannel_t channel)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Clear the UCSWRST bit to enable the I2C Module.
		REG8(base + I2CREG_CTL1) &= ~(UCSWRST);

		// Enable transmit, receive, and not-acknowledge interrupts.
		REG8(base + I2CREG_IE) |= UCTXIE | UCRXIE | UCNACKIE;
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CDisable
 *
 *	Description:	Turns off the specified I2C channel.  The configuration
 *					specified in the init function will be preserved, so you
 *					don't need to redo the init function after calling this.
 *
 *	Parameters:		i2cChannel_t channel - which I2C peripheral to act upon
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CDisable(i2cChannel_t channel)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Set the UCSWRST bit to disable the I2C Module.
		REG8(base + I2CREG_CTL1) |= UCSWRST;

		// Disable transmit, receive, and not-acknowledge interrupts.
		REG8(base + I2CREG_IE) &= ~(UCTXIE | UCRXIE | UCNACKIE);
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CIsBusy
 *
 *	Description:	This function indicates whether or not the I2C bus is busy.
 *					It checks the status of the UCBBUSY bit in UCBxSTAT
 *					register.  If you call I2CRead or I2CWrite while the bus is
 *					busy, then both I2C transactions will be clobbered.
 *
 *	Parameters:		i2cChannel_t channel - which I2C peripheral to act upon
 *
 *	Return Value:	TRUE if the I2C Master is busy; FALSE otherwise.
 *
 *****************************************************************************/

uint8_t I2CIsBusy (i2cChannel_t channel)
{
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

    // Check the bus busy bit of the STAT register.
	if ((REG8(base + I2CREG_STAT) & UCBBUSY)	||
		(REG8(base + I2CREG_STAT) & UCSCLLOW)	||
		(REG8(base + I2CREG_CTL1) & UCTXSTP)	||
		(REG8(base + I2CREG_CTL1) & UCTXSTT)	||
		(REG8(base + I2CREG_IFG) & UCTXIFG)		||
		(REG8(base + I2CREG_IFG) & UCRXIFG))
	{
		return 1;
	}
	return 0;
}

/******************************************************************************
 *
 *	Function:		I2CWrite
 *
 *	Description:	Writes to an I2C slave device.
 *
 *	Parameters:		i2cChannel_t channel - which I2C peripheral to act upon
 *					uint8_t *data - array of bytes to write to slave device
 *					uint32_t count - size of data array
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CWrite(i2cChannel_t channel, uint8_t *data, uint32_t count)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Set TX array start address.
		txDataPtr[channel] = data;

		// Load TX byte counter.
		txByteCtr[channel] = count;

		// Indicate that we're not reading.
		rxByteCtr[channel] = 0;

		// Send START + address + WRITE.
		REG8(base + I2CREG_CTL1) |= UCTXSTT | UCTR;

		// The rest of the message will be sent via ISR.
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CRead
 *
 *	Description:	Reads from an I2C slave device.
 *
 *	Parameters:		i2cChannel_t channel - which I2C peripheral to act upon
 *					uint8_t *data - array to put data read from the device
 *					uint32_t count - size of data array
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CRead(i2cChannel_t channel, uint8_t *data, uint32_t count)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Indicate that we're not writing.
		txByteCtr[channel] = 0;

		// Set RX array start address.
		rxDataPtr[channel] = data;

		// The case when we send only one byte is strange because of the way
		// the MSP430's I2C hardware state machine works...you have to send
		// START and STOP before you allow the interrupt to fire to get the
		// received byte.  This is similar to the case of the last byte of a
		// receive transaction (see Note 3 above).
		if (count == 1)
		{
			rxByteCtr[channel] = 0;

			// Disable receive interrupt.
			REG8(base + I2CREG_IE) &= ~UCRXIE;

			// Send START + address + READ.
			REG8(base + I2CREG_CTL1) &= ~UCTR;
			REG8(base + I2CREG_CTL1) |= UCTXSTT;

			// Wait for START to be sent.
			while (REG8(base + I2CREG_CTL1) & UCTXSTT);

			// Send STOP.
			REG8(base + I2CREG_CTL1) |= UCTXSTP;

			// Enable receive interrupt.
			REG8(base + I2CREG_IE) |= UCRXIE;
		}
		else if (count > 1)
		{
			// Set RX byte counter.  We subtract 1 because the I2C peripheral
			// reads the first byte after the START condition is sent, which is
			// before the ISR is called.  So by the time we get into the ISR
			// (which uses rxByteCtr), we've already got the first byte.  We
			// subtract another 1 because the ISR needs the rxByteCtr to be
			// 0-indexed.
			rxByteCtr[channel] = count - 2;

			// Send START + address + READ.
			REG8(base + I2CREG_CTL1) &= ~UCTR;
			REG8(base + I2CREG_CTL1) |= UCTXSTT;
		}
		else
		{
			return I2C_RESULT_INVALID_SELECTION;
		}

