adamj537/Code-Library/Processor_Peripherals/TI_MSP430x5/I2C.c
		// The rest of the message will be sent via ISR.
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CWriteThenRead
 *
 *	Description:	Writes to, and then reads from, an I2C devie.  This is a
 *					common practice, for example we may wish to read data from
 *					an I2C EEPROM, so we will write the location we wish to
 *					start reading from, and then read the data.
 *
 *	Parameters:		i2cChannel_t channel - which I2C peripheral to act upon
 *					uint8_t *writeData - array of bytes to write to slave device
 *					uint32_t writeCount - size of data array
 *					uint8_t *readData - array to put data read from the device
 *					uint32_t readCount - size of data array
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CWriteThenRead(i2cChannel_t channel, uint8_t *writeData,
	uint32_t writeCount, uint8_t *readData, uint32_t readCount)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Set TX array start address.
		txDataPtr[channel] = writeData;

		// Load TX byte counter.
		txByteCtr[channel] = writeCount;

		// Set RX array start address.
		rxDataPtr[channel] = readData;

		// Set RX byte counter.  Unlike in I2CRead, we don't subtract anything,
		// because we won't read any bytes until the ISR, and we need this to
		// be 1-indexed (for now).  It's tricky...you might want to step
		// through this operation with a debugger.
		rxByteCtr[channel] = readCount;

		// Send START + address + WRITE.
		REG8(base + I2CREG_CTL1) |= UCTXSTT | UCTR;

		// The rest of the message will be sent via ISR.
	}

	return result;
}

/******************************************************************************
 *
 *	Function:		I2CReadThenWrite
 *
 *	Description:	Writes to, and then reads from, an I2C devie.  This is not
 *					common, but the author thought "why not?".
 *
 *	Parameters:		i2cChannel_t channel - which I2C peripheral to act upon
 *					uint8_t *readData - array to put data read from the device
 *					uint32_t readCount - size of data array
 *					uint8_t *writeData - array of bytes to write to slave device
 *					uint32_t writeCount - size of data array
 *
 *	Return Value:	I2C_RESULT_OK for success; other values indicate failure
 *
 *****************************************************************************/

i2cResult_t I2CReadThenWrite(i2cChannel_t channel, uint8_t *readData,
		uint32_t readCount, uint8_t *writeData, uint32_t writeCount)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	uint16_t base = baseAddr[channel];	// Convert channel to base address.

	// Check for invalid channel.
	if (channel >= I2C_NUM_CHANNELS)
	{
		result = I2C_RESULT_INVALID_SELECTION;
	}

	else
	{
		// Set TX array start address.
		txDataPtr[channel] = writeData;

		// Load TX byte counter.
		txByteCtr[channel] = writeCount;

		// Set RX array start address.
		rxDataPtr[channel] = readData;

		// Set RX byte counter.  We subtract 1 because the I2C peripheral reads
		// the first byte after the START condition is sent, which is before
		// the ISR is called.  So by the time we get into the ISR (which uses
		// rxByteCtr), we've already got the first byte.
		rxByteCtr[channel] = readCount - 1;

		// Send START + address + READ.
		REG8(base + I2CREG_CTL1) &= ~UCTR;
		REG8(base + I2CREG_CTL1) |= UCTXSTT;

		// The rest of the message will be sent via ISR.
	}
	return result;
}

/******************************************************************************
 *	Test Functions
 *****************************************************************************/

#ifdef INCLUDE_TEST

#define I2C_ADDR	0x50

// First message:  Write to EEPROM.
const uint8_t writeMsg[] = {
	0x00,	// register to access
	0x00,	// value for register
	0x01,	// value for register
	0x02,	// value for register
	0x03,
	0x04,
	0x05,
};

// Second message:  Read from EEPROM.  This is for the "write-then-read" test.
const uint8_t readMsg[] = {
	0x00,	// EEPROM register to read from
};

uint8_t I2CTest(i2cChannel_t channel, uint8_t repeatFlag)
{
	i2cResult_t result = I2C_RESULT_OK;	// an optimistic return value :)
	i2cConfig_t config;					// module config data
	volatile uint8_t response[16];		// bytes received from EEPROM

	do	// I'm afraid of goto statements, so I'll use this instead ;}
	{
		// Setup the I2C configuration.
		config.mode = I2C_MODE_MASTER;
		config.speed = 10000;
		config.address = I2C_ADDR;
		config.generalCallEnable = 0;

		// Initialize the I2C peripheral with the configuration.
		result = I2CInit(channel, &config);
		if (result != I2C_RESULT_OK)
			break;

		// Enable the I2C peripheral.
		result = I2CEnable(channel);
		if (result != I2C_RESULT_OK)
			break;

		do	// This part can (optionally) be repeated.
		{
			// Try a read.
			result = I2CRead(channel, (uint8_t *)response, sizeof(response));
			if (result != I2C_RESULT_OK)
				break;

			// Wait until the device is not busy from the previous operation.
			while (I2CIsBusBusy(channel));

			// Try a write.
			result = I2CWrite(channel, (uint8_t *)writeMsg, sizeof(writeMsg));
			if (result != I2C_RESULT_OK)
				break;

			// Wait until the device is not busy from the previous operation.
			while (I2CIsBusBusy(channel));
			
			// Wait > 5 ms for the EEPROM to finish the write cycle (see
			// datasheet).  MCLK = 1048576 Hz (by default), so:
			// MCLK (1/s) * 0.005 s = 5242.88.  Round up to 5250, and wait that
			// many cycles.
			__delay_cycles(5250);

			// Try a write-then-read.
			result = I2CWriteThenRead(channel, (uint8_t *)readMsg,
				sizeof(readMsg), (uint8_t *)response, sizeof(response));
			if (result != I2C_RESULT_OK)
				break;

			// Wait until the device is not busy from the previous operation.
			while (I2CIsBusBusy(channel));

		} while (repeatFlag);			// Repeat if requested.
	} while (0);						// Don't repeat the initialization.

