adamj537/Code-Library/Processor_Peripherals/TI_MSP430x5/I2C.c
	return 0;
}

#endif	/* INCLUDE_TEST */

/******************************************************************************
 *
 *	Function:		I2C_ISR
 *
 *	Description:	This function is called by the interrupt handlers for this
 *					module.  It is structured such that it can be used to
 *					transmit any number of bytes by pre-loading a byte counter
 *					with the byte count, and doing some pointer math.  There
 *					are tricky things about how this hardware works, so	read
 *					Note 3 (above) to learn more.  Also, this function is
 *					declared as "inline" to speed up code execution in the ISR.
 *
 *	Parameters:		i2cChannel_t ch - which I2C peripheral to act upon
 *					volatile uint16_t reg - interrupt vector address
 *
 *****************************************************************************/

static inline void I2C_ISR(i2cChannel_t ch, volatile uint16_t reg)
{
	uint16_t base = baseAddr[ch];						// Convert channel to base address.

	switch(__even_in_range(reg,12))						// Find the interrupt's cause.
	{
	case  0: break;										// Vector  0: No interrupts
	case  2: break;										// Vector  2: ALIFG
	case  4:											// Vector  4: NACKIFG
		REG8(base + I2CREG_CTL1) |= UCTXSTP;			// Send STOP.
		REG8(base + I2CREG_CTL1) &= ~UCNACKIFG;			// Clear no-ACK flag.
		break;
	case  6: break;										// Vector  6: STTIFG
	case  8: break;										// Vector  8: STPIFG
	case 10:											// Vector 10: RXIFG
		if (rxByteCtr[ch])								// Check RX byte counter.
		{
			*rxDataPtr[ch] = REG8(base + I2CREG_RXBUF);	// Save received byte; fetch next byte.
			rxDataPtr[ch]++;							// Increment RX buffer pointer.
			rxByteCtr[ch]--;							// Decrement RX byte counter.
		}
		else if (txByteCtr[ch])							// Is this a read-then-write?
		{
			REG8(base + I2CREG_CTL1) |= UCTR;			// Set WRITE mode.
			REG8(base + I2CREG_CTL1) |= UCTXSTT;		// Send re-START.
		}
		else											// One byte left.
		{
			REG8(base + I2CREG_IE) &= ~UCRXIE;			// Disable RX interrupt (see Note 3).
			REG8(base + I2CREG_CTL1) |= UCTXSTP;		// Send STOP before last byte is read.
			*rxDataPtr[ch] = REG8(base + I2CREG_RXBUF);	// Save received byte; clear int flag.
			rxDataPtr[ch]++;							// Increment RX buffer pointer.
			REG8(base + I2CREG_IE) |= UCRXIE;			// Enable RX interrupt (see Note 3).
		}
		break;

	case 12:											// Vector 12: TXIFG
		if (txByteCtr[ch])								// Check TX byte counter.
		{
			REG8(base + I2CREG_TXBUF) = *txDataPtr[ch];	// Load TX buffer.
			txDataPtr[ch]++;							// Increment TX buffer pointer.
			txByteCtr[ch]--;							// Decrement TX byte counter
		}
		else if (rxByteCtr[ch] == 1)					// Is this a (1-byte) write-then-read?
		{
			REG8(base + I2CREG_IE) &= ~UCRXIE;			// Disable RX interrupt (see Note 3).
			REG8(base + I2CREG_CTL1) &= ~UCTR;			// Set READ mode.
			REG8(base + I2CREG_CTL1) |= UCTXSTT;		// Send re-START (but don't fetch).
			while (REG8(base + I2CREG_CTL1) & UCTXSTT);	// Wait for START to be sent.
			REG8(base + I2CREG_CTL1) |= UCTXSTP;		// Send STOP.
			REG8(base + I2CREG_IE) |= UCRXIE;			// Enable RX interrupt (see Note 3).
			rxByteCtr[ch]--;							// Decrement RX byte counter.
		}
		else if (rxByteCtr[ch])							// Is this a write-then-read?
		{
			REG8(base + I2CREG_CTL1) &= ~UCTR;			// Set READ mode.
			REG8(base + I2CREG_CTL1) |= UCTXSTT;		// Send re-START (fetches 1st byte).
			rxByteCtr[ch] -= 2;							// Decrement RX byte counter by 2.
		}
		else											// We're done!
		{
			REG8(base + I2CREG_CTL1) |= UCTXSTP;		// Send STOP.
//			REG8(base + I2CREG_IFG) &= ~UCTXIFG;		// Clear int flag.
		}
		break;

	default: break;
	}
}

/******************************************************************************
 *
 * 	Function:		USCI_B0_ISR, USCI_B1_ISR, USCI_B2_ISR, USCI_B3_ISR
 *
 * 	Description:	These are interrupt service routines that are triggered by
 * 					USCI events.  It looks messy because of define statements
 * 					which format the code differently for different compilers.
 * 					It is also automatically not included if the processor
 * 					we're using does not have this module.
 *
 *****************************************************************************/

#if defined(__MSP430_HAS_USCI_B0__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B0_VECTOR
__interrupt void USCI_B0_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B0_VECTOR))) USCI_B0_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_0, UCB0IV);
}

#endif /* USCI B0 */

#if defined(__MSP430_HAS_USCI_B1__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B1_VECTOR
__interrupt void USCI_B1_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B1_VECTOR))) USCI_B1_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_1, UCB1IV);
}

#endif /* USCI B1 */

#if defined(__MSP430_HAS_USCI_B2__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B2_VECTOR
__interrupt void USCI_B2_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B2_VECTOR))) USCI_B2_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_2, UCB2IV);
}

#endif /* USCI B2 */

#if defined(__MSP430_HAS_USCI_B3__)

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector = USCI_B3_VECTOR
__interrupt void USCI_B3_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_B3_VECTOR))) USCI_B3_ISR (void)
#else
#error Compiler not supported!
#endif
{
	I2C_ISR(I2C_3, UCB3IV);
}

#endif /* USCI B3 */
